<template>

    <view :style="{ paddingTop:`${customBarHeight}px`}">
      <view  class="px-6">
        <view class="pt-8">
          <view class="text-lg font-medium text-gray-800">用户服务协议</view>
          <view class="text-xs font-light leading-5 text-gray-900">
            <h3 class="text-base font-medium py-5">一、引言</h3>
<p>
欢迎您使用本微信小程序（以下简称 “本小程序”）！本用户服务协议（以下简称 “本协议”）是您与上海哈芙琳服装有限公司（以下简称 “我们”）之间关于使用本小程序的法律协议。在使用本小程序前，请您仔细阅读并充分理解本协议的全部内容。您使用本小程序的行为即视为您已接受本协议的约束。若您不同意本协议的任何条款，请不要使用本小程序。</p>

<h3 class="text-base font-medium py-5">二、定义</h3>
1. 本小程序：指由我们开发、运营并通过微信平台提供服务的应用程序。<br>

2. 用户：指使用本小程序的自然人、法人或其他组织。<br>

3. 服务：指本小程序向用户提供的各项功能和服务，包括但不限于信息展示、交互、数据处理等。<br>

<h3 class="text-base font-medium py-5">三、服务内容与提供</h3>
1. 服务内容：我们致力于为用户提供 校服的产品追溯，质检报告展示和穿着该校服学生信息的查询等服务。具体服务内容以本小程序实际展示和提供的为准。<br>

2. 服务变更：我们有权根据业务发展、法律法规变化等原因，对服务内容进行调整、更新或终止。我们将通过本小程序公告、弹窗提示等方式通知用户相关变更情况。若用户在服务变更后继续使用本小程序，视为其接受变更后的服务内容和本协议。<br>

3. 服务中断与终止：因系统维护、升级、网络故障、不可抗力等原因，可能导致服务中断或终止。我们将尽可能提前通知用户，并在故障排除后尽快恢复服务。若因用户违反本协议或法律法规，我们有权不经通知随时终止向用户提供服务。<br>

<h3 class="text-base font-medium py-5">四、用户权利与义务</h3>
<h4>（一）权利</h4>
1. 用户有权在遵守本协议及相关法律法规的前提下，自由使用本小程序提供的各项服务。<br>

2. 用户有权对其在本小程序中提供的个人信息进行查询、更正、删除等操作（具体操作方式及权限以本小程序实际设置为准）。<br>

3. 用户有权就本小程序的使用体验、服务质量等问题向我们提出意见和建议。<br>

<h4>（二）义务</h4>
1. 用户应提供真实、准确、完整的注册和使用信息，并及时更新。不得提供虚假、误导性信息，否则我们有权暂停或终止服务。<br>

2. 用户应遵守法律法规及社会公德，不得利用本小程序从事违法违规活动，包括但不限于传播淫秽、色情、暴力、恐怖、赌博等有害信息；侵犯他人知识产权、人身权、财产权等合法权益；进行网络攻击、恶意刷单、扰乱服务秩序等行为。<br>

3. 用户应妥善保管其账号及密码，不得将账号转借他人使用。因用户原因导致账号被盗用、信息泄露等后果，由用户自行承担责任。<br>

4. 用户在使用本小程序过程中，应尊重我们及其他用户的合法权益，不得发布辱骂、诽谤、骚扰等不当言论。<br>

<h3 class="text-base font-medium py-5">五、知识产权</h3>
1. 本小程序的所有知识产权，包括但不限于软件代码、设计、文字、图片、音频、视频等，均归我们所有。未经我们书面许可，用户不得擅自复制、传播、修改、出售、出租或以其他方式使用本小程序的任何部分。<br>

2. 用户在使用本小程序过程中所产生的内容（如上传的图片、评论等），其知识产权归用户所有。但用户授予我们在全球范围内、永久性、不可撤销、免费的许可，以使用、复制、修改、改编、出版、翻译、传播、展示、表演这些内容，用于本小程序的运营、推广及其他合法目的。<br>

<h3 class="text-base font-medium py-5">六、隐私保护</h3>
我们重视用户的隐私保护，将按照本小程序的隐私政策（单独制定并发布）收集、使用、存储和保护用户的个人信息。用户同意我们按照隐私政策处理其个人信息。<br>

<h3 class="text-base font-medium py-5">七、违约责任</h3>
若用户违反本协议，应承担因此给我们及其他用户造成的全部损失，包括但不限于直接损失、间接损失、可得利益损失、维权费用（如律师费、诉讼费、公证费等）。我们有权根据用户违约情况，采取暂停服务、终止服务、封禁账号等措施。<br>

<h3 class="text-base font-medium py-5">八、法律适用与争议解决</h3>
1. 本协议的签订、履行、解释及争议解决均适用中华人民共和国法律（为本协议之目的，不包括香港特别行政区、澳门特别行政区和台湾地区法律）。<br>

2. 若双方在本协议履行过程中发生争议，应首先通过友好协商解决；协商不成的，任何一方均有权向有管辖权的人民法院提起诉讼。<br>

<h3 class="text-base font-medium py-5">九、其他条款</h3>
1. 本协议构成双方关于本小程序使用的完整协议，取代之前双方就本小程序使用达成的所有口头或书面协议。<br>

2. 若本协议的任何条款被认定为无效或不具备执行力，不影响其他条款的效力和执行。我们将对无效或不具备执行力的条款进行修改或调整，以确保本协议的整体目的得以实现。<br>

3. 我们未行使或延迟行使本协议项下的任何权利，不应被视为对该权利的放弃。<br>

4. 本协议自用户首次使用本小程序之日起生效。<br>
          </view>
        </view>
      </view>
      <view
            @click="goBack" 
            class="fixed bottom-0 left-0 right-0 flex justify-center items-center w-full h-16 bg-white">
            <image
            class="icon_home"
            mode="aspectFit"
            src="/static/icons/home.png"
            />
      </view>
    </view>

</template>

<script lang="ts" setup>
import { useWindowInfo } from '@/hooks/useWindowInfo'

const { customBarHeight } = useWindowInfo()
function goBack() {
  uni.navigateBack({
    delta: 1
  })
}
</script>

<style scoped>
.icon_home {
    width: 68.7rpx;
    height: 59.16rpx;
}
</style>