<template>
    <view :style="{ paddingTop:`${customBarHeight}px`}">
      <view  class="px-6">
        <view class="pt-8">
          <view class="text-lg font-medium text-gray-800">隐私政策</view>
          <view class="text-xs font-light leading-5 text-gray-900">
            <h3 class="text-base font-medium py-5">一、引言</h3>
我们深知个人信息对您的重要性，并会尽全力保护您的个人信息安全。本隐私政策旨在向您说明，在您使用我们的微信小程序（以下简称 “本小程序”）时，我们如何收集、使用、存储、共享、转让和保护您的个人信息。请您在使用本小程序前，仔细阅读并充分理解本隐私政策的全部内容。若您不同意本隐私政策的任何条款，请不要使用本小程序。<br>

<h3 class="text-base font-medium py-5">二、定义</h3>
1. 个人信息：指以电子或者其他方式记录的能够单独或者与其他信息结合识别特定自然人身份或者反映特定自然人活动情况的各种信息。<br>

2. 敏感个人信息：指一旦泄露或者非法使用，容易导致自然人的人格尊严受到侵害或者人身、财产安全受到危害的个人信息，包括生物识别、宗教信仰、特定身份、医疗健康、金融账户、行踪轨迹等信息，以及不满十四周岁未成年人的个人信息。<br>

3. 我们：指本小程序的运营方上海哈芙琳服装有限公司。<br>

<h3 class="text-base font-medium py-5">三、信息收集</h3>
<h4 class="font-medium py-2">（一）收集方式</h4>
1. 用户主动提供：当您使用本小程序的 [关联生信息] 时，您需要主动向我们提供相关个人信息，如姓名、班级年级、性别、手机号等。<br>

2. 自动采集：在您使用本小程序过程中，我们可能会通过技术手段自动采集一些信息，包括但不限于设备信息（如设备型号、操作系统版本、唯一设备标识符等）、网络信息（如 IP 地址、网络接入方式等）、使用行为信息（如访问时间、浏览页面、点击操作等）。<br>

<h4 class="font-medium py-2">（二）收集目的</h4>
1. 为您提供产品追踪服务，根据学生信息可以快到自己的校服。<br>

2. 遇到紧急情况可以联系监护人等实用功能。<br>

3. 开展市场调研和数据分析，了解用户需求和行为，以便改进产品和服务。<br>

<h4 class="font-medium py-2">（三）收集范围</h4>
1. 必要信息：为实现本小程序的基本功能，我们需要收集一些必要的个人信息。例如，为了让您使用信息采集功能，我们可能需要收集学生的姓名、性别、年级班级和联系方式。具体必要信息以本小程序实际功能需求为准。<br>

2. 非必要信息：除必要信息外，我们可能还会收集一些其他信息，这些信息有助于我们为您提供更个性化的服务。您可以选择是否提供这些非必要信息，不提供不会影响您使用本小程序的基本功能。<br>

<h3 class="text-base font-medium py-5">四、信息使用</h3>
1. 我们将严格按照本隐私政策及相关法律法规的规定，使用您的个人信息。我们使用个人信息的目的主要包括提供服务、优化服务、保障安全、开展营销活动等。<br>

2. 在使用您的个人信息时，我们会采取合理的技术和管理措施，对信息进行去标识化或匿名化处理，以降低信息泄露风险。<br>

<h3 class="text-base font-medium py-5">五、信息存储</h3>
1. 我们将在中华人民共和国境内存储您的个人信息。若因业务需要将个人信息传输至境外，我们将遵守相关法律法规的规定，履行必要的程序和保障措施。<br>

2. 我们将根据法律法规及业务需求确定个人信息的存储期限。一般情况下，在您停止使用本小程序后，我们将在合理期限内保留您的个人信息，超出期限后将进行删除或匿名化处理。<br>

<h3 class="text-base font-medium py-5">六、信息共享、转让与公开披露</h3>
<h4 class="font-medium py-2">（一）信息共享</h4>
<ul>
<li>1. 我们不会向第三方共享您的个人信息，除非获得您的明确同意。但在以下情况下，我们可能会在必要范围内向第三方共享您的个人信息：</li>

<li>与关联公司共享：为便于我们统一管理和为您提供更全面的服务，我们可能会与关联公司共享您的个人信息，但我们会要求关联公司遵守本隐私政策及相关法律法规的规定。</li>

<li>与合作伙伴共享：我们可能会与为我们提供技术支持、数据分析、营销推广等服务的合作伙伴共享您的个人信息。例如，为了实现小程序的某些功能，我们可能会与技术服务提供商共享您的设备信息。我们会与合作伙伴签订严格的保密协议，要求他们按照我们的要求和相关法律法规处理您的个人信息。</li>

<li>在共享个人信息前，我们会对共享的必要性、数据类型、共享范围等进行评估，并确保共享行为符合法律法规的规定。</li>
</ul>
<h4 class="font-medium py-2">（二）信息转让</h4>
我们不会将您的个人信息转让给第三方，除非获得您的明确同意。但在公司合并、分立、收购、资产转让等情况下，可能涉及个人信息的转让。在这种情况下，我们会要求接收方继续遵守本隐私政策及相关法律法规的规定，保护您的个人信息。<br>

<h4 class="font-medium py-2">（三）公开披露</h4>
我们不会公开披露您的个人信息，除非获得您的明确同意或法律法规另有要求。在法律要求公开披露的情况下，我们会在公开披露前进行必要的风险评估，并采取适当的措施保护您的个人信息安全。<br>

<h3 class="text-base font-medium py-5">七、用户权利</h3>
1. 查询权：您有权查询您在本小程序中提供的个人信息。您可以通过本小程序提供的查询功能或联系我们的方式进行查询。<br>

2. 更正权：如果您发现您的个人信息有误，您有权要求我们进行更正。您可以通过本小程序提供的更正功能或联系我们的方式提出更正请求。<br>

3. 删除权：在符合法律法规规定的情况下，您有权要求我们删除您的个人信息。例如，当我们处理个人信息的目的已实现、无法实现或者为实现处理目的不再必要时，您可以要求删除。您可以通过本小程序提供的删除功能或联系我们的方式提出删除请求。<br>

4. 撤回同意权：对于需要您同意才能收集和使用的个人信息，您有权随时撤回同意。撤回同意后，我们将不再基于该同意收集和使用您的个人信息，但不影响撤回前已进行的处理行为的合法性。您可以通过本小程序的设置或联系我们的方式撤回同意。<br>

5. 投诉举报权：如果您认为我们在处理您的个人信息过程中存在违反法律法规或本隐私政策的行为，您有权向我们投诉举报。我们将在收到投诉举报后及时进行处理，并向您反馈处理结果。<br>

<h3 class="text-base font-medium py-5">八、信息安全</h3>
1. 我们采取技术和管理措施，保障您的个人信息安全。技术措施包括但不限于加密传输、访问控制、数据备份等；管理措施包括但不限于建立信息安全管理制度、对员工进行信息安全培训等。<br>

2. 尽管我们采取了合理的措施保护您的个人信息，但网络环境复杂多变，仍存在一定的安全风险。若发生个人信息泄露等安全事件，我们将及时通知您，并按照法律法规的要求采取相应的补救措施。<br>

<h3 class="text-base font-medium py-5">九、政策更新</h3>
我们将根据法律法规的变化、业务发展等情况，适时更新本隐私政策。更新后的隐私政策将在本小程序显著位置发布。若您在政策更新后继续使用本小程序，视为您已接受更新后的隐私政策。<br>

<h3 class="text-base font-medium py-5">十、联系我们</h3>
如果您对本隐私政策有任何疑问、意见或建议，或者您想行使您的用户权利，请通过以下方式联系我们：<br>

联系邮箱：zhangli@halfrin.com<br>

我们将在收到您的反馈后，尽快与您联系并处理相关问题。<br>
          </view>
        </view>
      </view>
      <view
            @click="goBack" 
            class="fixed bottom-0 left-0 right-0 flex justify-center items-center w-full h-16 bg-white">
            <image
            class="icon_home"
            mode="aspectFit"
            src="/static/icons/home.png"
            />
      </view>
    </view>
</template>

<script lang="ts" setup>
import { useWindowInfo } from '@/hooks/useWindowInfo'

const { customBarHeight } = useWindowInfo()
function goBack() {
  uni.navigateBack({
    delta: 1
  })
}
</script>

<style scoped>
.icon_home {
    width: 68.7rpx;
    height: 59.16rpx;
}
</style>